courts = {
    "А01": {
        "court_name": "Арбитражный суд Республики Адыгея",
        "court_address": "385000, Республика Адыгея, г. Майкоп, ул. Краснооктябрьская, 15"
    },
    "А03": {
        "court_name": "Арбитражный суд Алтайского края",
        "court_address": "656015, г. Барнаул, просп. Ленина, 76"
    },
    "А04": {
        "court_name": "Арбитражный суд Амурской области",
        "court_address": "675023, г. Благовещенск, ул. Ленина, 163"
    },
    "А05": {
        "court_name": "Арбитражный суд Архангельской области",
        "court_address": "163000, г. Архангельск, ул. Логинова, д. 17"
    },
    "А40": {
        "court_name": "Арбитражный суд города Москвы",
        "court_address": "115225, г. Москва, ул. Большая Тульская, 17"
    }
}
